---
kind: property
id: P:Autodesk.Revit.DB.WallSweepInfo.Id
source: html/463e3eb1-1bbf-9117-fe02-45da2a59c7ac.htm
---
# Autodesk.Revit.DB.WallSweepInfo.Id Property

The id of the sweep or reveal.

## Syntax (C#)
```csharp
public int Id { get; set; }
```